In [1]:
# ADVANCED SQL PROJECT USING SQLITE (GOOGLE COLAB READY)

import sqlite3
import pandas as pd

# Create in-memory database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create Table
cursor.execute('''
CREATE TABLE Students (
    Roll_No INTEGER PRIMARY KEY,
    Name TEXT,
    Class TEXT,
    Section TEXT,
    Subject TEXT,
    Marks INTEGER
)
''')

# Insert Data
students_data = [
    (1, 'Arnab', '10', 'A', 'Math', 100),
    (2, 'Sauda', '10', 'A', 'Science', 78),
    (3, 'Turjo', '10', 'B', 'Math', 92),
    (4, 'Mira', '10', 'B', 'Science', 88),
    (5, 'Rahim', '9', 'A', 'Math', 74),
    (6, 'Karim', '9', 'A', 'Science', 69),
    (7, 'Nabila', '9', 'B', 'Math', 95),
    (8, 'Arif', '9', 'B', 'Science', 81),
    (9, 'Sadia', '10', 'A', 'Math', 90),
    (10, 'Rafi', '10', 'B', 'Science', 72)
]

cursor.executemany("INSERT INTO Students VALUES (?, ?, ?, ?, ?, ?)", students_data)
conn.commit()

print("---- ALL STUDENTS ----")
print(pd.read_sql_query("SELECT * FROM Students", conn))

print("\n---- DISTINCT CLASSES ----")
print(pd.read_sql_query("SELECT DISTINCT Class FROM Students", conn))

print("\n---- ORDER BY MARKS (DESCENDING) ----")
print(pd.read_sql_query("SELECT Name, Subject, Marks FROM Students ORDER BY Marks DESC", conn))

print("\n---- GROUP BY SUBJECT WITH AVERAGE MARKS ----")
print(pd.read_sql_query("SELECT Subject, AVG(Marks) AS Average_Marks FROM Students GROUP BY Subject", conn))

print("\n---- COUNT STUDENTS IN EACH CLASS ----")
print(pd.read_sql_query("SELECT Class, COUNT(*) AS Total_Students FROM Students GROUP BY Class", conn))

print("\n---- TOTAL MARKS PER SUBJECT ----")
print(pd.read_sql_query("SELECT Subject, SUM(Marks) AS Total_Marks FROM Students GROUP BY Subject", conn))

print("\n---- HIGHEST AND LOWEST MARKS PER SUBJECT ----")
print(pd.read_sql_query("SELECT Subject, MAX(Marks) AS Highest, MIN(Marks) AS Lowest FROM Students GROUP BY Subject", conn))

print("\n---- SUBJECTS WITH AVERAGE MARKS GREATER THAN 80 (HAVING) ----")
print(pd.read_sql_query("SELECT Subject, AVG(Marks) AS Avg_Marks FROM Students GROUP BY Subject HAVING AVG(Marks) > 80", conn))

print("\n---- STUDENTS WHO SCORED MORE THAN 85 (WHERE) ----")
print(pd.read_sql_query("SELECT Name, Subject, Marks FROM Students WHERE Marks > 85 ORDER BY Marks DESC", conn))

conn.close()

---- ALL STUDENTS ----
   Roll_No    Name Class Section  Subject  Marks
0        1   Arnab    10       A     Math    100
1        2   Sauda    10       A  Science     78
2        3   Turjo    10       B     Math     92
3        4    Mira    10       B  Science     88
4        5   Rahim     9       A     Math     74
5        6   Karim     9       A  Science     69
6        7  Nabila     9       B     Math     95
7        8    Arif     9       B  Science     81
8        9   Sadia    10       A     Math     90
9       10    Rafi    10       B  Science     72

---- DISTINCT CLASSES ----
  Class
0    10
1     9

---- ORDER BY MARKS (DESCENDING) ----
     Name  Subject  Marks
0   Arnab     Math    100
1  Nabila     Math     95
2   Turjo     Math     92
3   Sadia     Math     90
4    Mira  Science     88
5    Arif  Science     81
6   Sauda  Science     78
7   Rahim     Math     74
8    Rafi  Science     72
9   Karim  Science     69

---- GROUP BY SUBJECT WITH AVERAGE MARKS ----
   Subject  Average_Marks
0     Math           90.2
1  Science           77.6

---- COUNT STUDENTS IN EACH CLASS ----
  Class  Total_Students
0    10               6
1     9               4

---- TOTAL MARKS PER SUBJECT ----
   Subject  Total_Marks
0     Math          451
1  Science          388

---- HIGHEST AND LOWEST MARKS PER SUBJECT ----
   Subject  Highest  Lowest
0     Math      100      74
1  Science       88      69

---- SUBJECTS WITH AVERAGE MARKS GREATER THAN 80 (HAVING) ----
  Subject  Avg_Marks
0    Math       90.2

---- STUDENTS WHO SCORED MORE THAN 85 (WHERE) ----
     Name  Subject  Marks
0   Arnab     Math    100
1  Nabila     Math     95
2   Turjo     Math     92
3   Sadia     Math     90
4    Mira  Science     88